# Завдання 1
# Маємо три кортежі цілих чисел. Знайдіть елементи, які є у всіх кортежах.

t1 = (1, 2, 3, 4, 5)
t2 = (3, 4, 5, 6, 7)
t3 = (0, 3, 4, 9)

common = set(t1) & set(t2) & set(t3)

print("Спільні елементи:", tuple(common))


# Завдання 2
# Маємо три кортежі цілих чисел. Знайдіть елементи, які унікальні для кожного списку.

t1 = (1, 2, 3, 4, 5)
t2 = (3, 4, 6, 7)
t3 = (4, 5, 7, 8)

s1 = set(t1)
s2 = set(t2)
s3 = set(t3)

unique = (s1 - s2 - s3) | (s2 - s1 - s3) | (s3 - s1 - s2)

print("Унікальні елементи:", unique)

# Завдання 3
# Маємо три кортежі цілих чисел. Знайдіть елементи,
# які є в кожному з кортежів і знаходяться в кожному з них на тій самій позиції.

t1 = (1, 2, 3, 4, 5)
t2 = (1, 7, 3, 9, 5)
t3 = (1, 2, 3, 4, 0)

result = tuple(a for a, b, c in zip(t1, t2, t3, strict=False) if a == b == c)

print(result)
