# Завдання 1
# Користувач вводить текст і набір символів. Видаліть з тексту всі
# слова, що містять хоча б один з цих символів, і виведіть результат.

import re

text = input("Введіть текст: ")
symbols = input("Введіть символи: ")
pattern = r"\b\w*[" + re.escape(symbols) + r"]\w*\b"
result = re.sub(pattern, "", text)
result = " ".join(result.split())
print("Результат:", result)
# Завдання 2
# Створіть програму, яка із введеного тексту створює "зворотний текст"
# (перевертає текст на рівні слів, а не символів). Наприклад, "я люблю Python"
# перетворюється на "Python люблю я"

text = input("Введіть текст: ")

words = text.split()
words.reverse()
reversed_text = " ".join(words)
print(reversed_text)


# Завдання 3
# Напиши програму, яка читає з консолі 1 рядок і визначає, чи є він валідним ідентифікатором змінної,
# валідний ідентифікатор має правила:
#
# Перший символ це латинська літера A-Z або a-z або символ підкреслення _
#
# Далі можуть бути латинські літери, цифри або _
#
# Довжина від 1 до 20 символів включно
#
# Треба вивести:
#
# OK якщо рядок валідний
#
# NO якщо невалідний
identifier = input("Введіть рядок: ")
pattern = r"^[A-Za-z_][A-Za-z0-9_]{0,19}$"
if re.match(pattern, identifier):
    print("OK")
else:
    print("NO")
